Revit 2027 API
AreaBasedLoadData.GetUpstreamNodeId Method
 Gets the upstream electrical analytical node id.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId GetUpstreamNodeId()
Public Function GetUpstreamNodeId As ElementId
public:
ElementId^ GetUpstreamNodeId()
member GetUpstreamNodeId : unit -> ElementId
Return Value
ElementId
 The upstream node id.
Remarks
 If the area based load supplies from Node A, Node A is the upstream node of the area based load, and the area based load is the downstream node of node A.
See Also
Reference
AreaBasedLoadData Class
Autodesk.Revit.DB.Electrical Namespace